In [3]:
pip install pandas

Requirement already satisfied: pandas in c:\users\devme\anaconda3\lib\site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\devme\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\devme\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\devme\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\devme\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\devme\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [5]:
import pandas as pd

In [6]:
import numpy as np

In [7]:
data = pd.read_csv("Travel.csv")

In [ ]:
1. What is the distribution of customerages, and how does age relate to product purchase (ProdTaken)?

In [8]:
data_prod_taken_1 = data[data['ProdTaken'] == 1]

In [9]:
age = data_prod_taken_1['Age'].value_counts()
print(age)

Age
29.0    57
30.0    48
34.0    44
31.0    41
33.0    40
32.0    40
26.0    37
35.0    34
27.0    30
36.0    27
28.0    26
20.0    25
37.0    24
41.0    24
40.0    23
21.0    23
19.0    21
25.0    20
42.0    20
24.0    18
45.0    18
44.0    17
51.0    17
38.0    15
22.0    15
39.0    14
52.0    14
23.0    13
59.0    12
50.0    12
56.0    12
47.0    12
58.0    11
48.0    11
46.0    11
43.0    10
49.0     9
18.0     8
53.0     8
55.0     7
57.0     5
54.0     2
60.0     1
Name: count, dtype: int64

In [14]:
pt = pd.pivot_table(data, index='Age', values='ProdTaken', aggfunc=np.sum)

In [15]:
pt

      ProdTaken
Age
18.0          8
19.0         21
20.0         25
21.0         23
22.0         15
23.0         13
24.0         18
25.0         20
26.0         37
27.0         30
28.0         26
29.0         57
30.0         48
31.0         41
32.0         40
33.0         40
34.0         44
35.0         34
36.0         27
37.0         24
38.0         15
39.0         14
40.0         23
41.0         24
42.0         20
43.0         10
44.0         17
45.0         18
46.0         11
47.0         12
48.0         11
49.0          9
50.0         12
51.0         17
52.0         14
53.0          8
54.0          2
55.0          7
56.0         12
57.0          5
58.0         11
59.0         12
60.0          1
61.0          0

In [ ]:
2. How does the type of contact(type of contact)influence the likelihood of purchasing a
travel product?

In [16]:
typeofcontact=pd.pivot_table(data, values='ProdTaken', index='TypeofContact', aggfunc=np.sum)

In [17]:
typeofcontact

                 ProdTaken
TypeofContact
Company Invited        310
Self Enquiry           607

In [ ]:
3. Is there a correlation between the city tier(citytier)and monthly income (monthly
income) of customers?

In [24]:
ctmi = pd.pivot_table(data, values='MonthlyIncome', index='CityTier', aggfunc=np.mean)

In [25]:
ctmi

          MonthlyIncome
CityTier
1          23418.100165
2          23773.161458
3          24023.795549

In [ ]:
4 . What is the average duration of a pitch (duration of pitch)for customers who
purchased a product versus those who did not?

In [27]:
purchased =  pd.pivot_table(data_prod_taken_1 , values='DurationOfPitch', index='ProductPitched', aggfunc=np.mean)
purchased

                DurationOfPitch
ProductPitched
Basic                 15.791353
Deluxe                19.100000
King                  10.500000
Standard              19.065041
Super Deluxe          18.500000

In [28]:
data_prod_taken_0 = data[data['ProdTaken']==0]

In [29]:
notpurchased =  pd.pivot_table(data_prod_taken_0 , values='DurationOfPitch', index='ProductPitched', aggfunc=np.mean)
notpurchased

                DurationOfPitch
ProductPitched
Basic                 14.940753
Deluxe                15.517975
King                  12.252381
Standard              15.373786
Super Deluxe          16.090062

In [ ]:
5. How do occupation types(occupation)distribute among customers,and is there an
occupation type that is more likely to purchase a travel product?

In [30]:
occupation=data['Occupation'].value_counts()
occupation

Occupation
Salaried          2368
Small Business    2084
Large Business     434
Free Lancer          2
Name: count, dtype: int64

In [ ]:
6. Are there any gender-based preferences for the type of product pitched
(ProductPitched)?

In [34]:
ch = data.groupby("Gender")["ProductPitched"].count()

In [35]:
ch

Gender
Fe Male     155
Female     1817
Male       2916
Name: ProductPitched, dtype: int64

In [ ]:
7. What is the relationship between the number of trips(number of trips)taken by a
customer and their likelihood to purchase a new travel product?

In [38]:
relation=pd.pivot_table(data,values='ProdTaken',index='NumberOfTrips',aggfunc=np.count_nonzero)
relation

               ProdTaken
NumberOfTrips
1.0                  112
2.0                  299
3.0                  217
4.0                   61
5.0                   62
6.0                   64
7.0                   62
8.0                   29
19.0                   1
20.0                   1
21.0                   0
22.0                   0

In [ ]:
8. Does having a passport(passport)correlate with a higher number of trips taken or a
higher likelihood of purchasing a travel product?

In [40]:
highernum = data.groupby('Passport')['NumberOfTrips'].sum()
highernum

Passport
0    10836.0
1     4531.0
Name: NumberOfTrips, dtype: float64

In [ ]:
9. How satisfied are customers with the pitch (pitch satisfaction score),and does this
satisfaction influence product purchase?

In [41]:
satisfaction=data.groupby('PitchSatisfactionScore')['CustomerID'].count()
satisfaction

PitchSatisfactionScore
1     942
2     586
3    1478
4     912
5     970
Name: CustomerID, dtype: int64

In [ ]:
10. Among customers with children (number of children visiting), how does the number
of children impact travel product purchases?

In [42]:
impact = pd.pivot_table(data, index='NumberOfChildrenVisiting', values= 'ProdTaken', aggfunc=np.sum)

In [43]:
impact

                          ProdTaken
NumberOfChildrenVisiting
0.0                             202
1.0                             392
2.0                             253
3.0                              66

In [ ]:
11. Gender preferences for product types: how does gender influence the preference for
different types of travel products pitched (product pitched)?

In [46]:
product = pd.pivot_table(data, index='Gender', columns='ProductPitched', aggfunc='size', fill_value=0)
product

ProductPitched  Basic  Deluxe  King  Standard  Super Deluxe
Gender
Fe Male             4      83     0        63             5
Female            676     641    82       263           155
Male             1162    1008   148       416           182

In [ ]:
12. Impact of marital status on travel preferences: does marital status affect the choice of
travel product, and if so, how do different marital statuses correlate with product

In [48]:
status = pd.pivot_table(data, index='MaritalStatus', columns='ProductPitched', aggfunc='size', fill_value=0)
status

ProductPitched  Basic  Deluxe  King  Standard  Super Deluxe
MaritalStatus
Divorced          332     336    52       142            88
Married           816     852   126       380           166
Single            511     221    52        50            82
Unmarried         183     323     0       170             6